app/controllers/api/friends_controller.rb

    def index
        @friends = Friend.where(:user_id => current_user.id) #we can use this to grab all friends of current user for friends nav bar
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]