app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at", "tag", "birth_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save